{
  "data": [
    {
      "name": "DANIEL AWIGRA",
      "jobs": "Co-Founder / Team Leader",
      "position": "(Executive Director, HRWG)",
      "image": "/images/team/awi.jpeg",
      "description": "Daniel Awigra is a human rights activist and the Executive Director of Indonesia’s NGO Coalition for International Human Rights Advocacy or Human Rights Working Group (HRWG; www.hrwg.or.id) in Indonesia, where he leads the work of BEBESEA secretariat among many other regional and international human rights advocacy work. He has extensive experience of leading regional and national multi-stakeholders’ policy dialogues on the ASEAN Consensus on the protection of migrant workers’ rights in ASEAN member states. He has served as the International Advocacy Presidium of Jaringan Buruh Migran (Migrant Workers Network) since 2015, and co-founded Journalist Association for Diversity (SEJUK; sejuk.org) in 2008. He holds an MSc in International Relations from the University of Indonesia."
    },
    {
      "name": "MARIKO HAYASHI",
      "jobs": "Co-Founder",
      "position": "(Executive Director, SEEAC)",
      "image": "/images/team/mariko.jpeg",
      "description": "Mariko currently serves as the Executive Director of Southeast and East Asian Centre (SEEAC), a London based civil society and community organisation led by and for migrants, refugees and people seeking asylum from East and Southeast Asia. She is also a freelance consultant, researcher and project coordinator focusing on migration and human rights, and strategises and coordinates the activities of BEBESEA. She previously worked as a Program Officer at the Sasakawa Peace Foundation, where she initiated building and strengthening a cross-regional network of migrant rights advocates in East and Southeast Asia in cooperation with HRWG – this network later became BEBESEA. Trustee of Kanlungan Filipino Consortium and Protection Approaches."
    },
    {
      "name": "ENA MARIE AVILA",
      "jobs": "Social Media and Communications Officer",
      "position": null,
      "image": "/images/team/ena.jpeg",
      "description": "Ena is a graduate at Notre Dame of Dadiangas University with an accounting degree but pursued a graphic design career. She has been doing freelance designing work from local and international clients. She develops and implements BEBESEA’s communication strategies and is in charge of creating and disseminating the multimedia contents as well as social media engagement. Currently, she is also the Auditor and one of the heads of the Branding and Creatives Committee of YABONG Philippines Inc, an organization that aims on educating the youth about media and information literacy."
    },
    {
      "name": "ARIELA NAOMI SYIFA (IFA)",
      "jobs": null,
      "position": "(Program Officer, HRWG)",
      "image": "/images/team/ifa.jpeg",
      "description": "Ifa is also a recent Bachelor of International Relations graduate from Universitas Pembangunan Nasional “Veteran” Jakarta with a thesis about the research on The Effect of COVID-19 on the Protection of Migrant Workers’ Rights in the Construction Sector in Singapore and now is working as Program Officer in Human Rights Working Group (HRWG). Despite her academic major, she is also really interested in the graphic designing field that reflects on her contribution working for some organizations’ social media visualizations. Before joining HRWG and BEBESEA, She has worked for campus internal radio community named Fourtyfive Radio as Creative Director and Announcer. When she was an intern in HRWG a year ago, She has worked on some posters for their webinars and has also been the opening MC for two of them. She has also worked on HRWG produced podcast, HAMburger Podcast, as its Social Media Graphic Designer."
    },
    {
      "name": "ARDHI ROSYADI",
      "jobs": null,
      "position": "(Program Manager, HRWG)",
      "image": "/images/team/jesse.jpeg",
      "description": "Jesse is currently working as a program manager of the Human Rights Working Group (HRWG). Before joining the NGO, he was a journalist and also has been involved in human rights and civil society movements as an individual since he was still a college student. He graduated from Faculty of Communication, Tarumanagara University, with a thesis on the role of media in one of the biggest human right violations which happened in Indonesia in 1965. For BEBESEA, he leads the production of podcast episodes and supports overall communication strategies as well as project implementation."
    }
  ]
}
